swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.h
/***************************************************************************//**
* \file CapSense_1_Sensing.h
* \version 3.0
*
* \brief
*   This file provides the headers of APIs specific to implementation of the
*   sensing FW block.
*
* \see CapSense_1 v3.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(CY_SENSE_CapSense_1_SENSING_H)
#define CY_SENSE_CapSense_1_SENSING_H

#include "gpio/cy_gpio.h"
#include "cyfitter.h"
#include "syslib/cy_syslib.h"
#include "sysclk/cy_sysclk.h"
#include "CapSense_1_Configuration.h"
#include "CapSense_1_Structure.h"

#if (CY_CPU_CORTEX_M0P)
    #define CapSense_1_CPU_CLOCK_FREQ_HZ  (CYDEV_CLK_SLOWCLK__HZ)
    #define CapSense_1_CPU_CLOCK_FREQ_KHZ (CYDEV_CLK_SLOWCLK__KHZ)
    #define CapSense_1_CPU_CLOCK_FREQ_MHZ (CYDEV_CLK_SLOWCLK__MHZ)
#else
    #define CapSense_1_CPU_CLOCK_FREQ_HZ  (CYDEV_CLK_FASTCLK__HZ)
    #define CapSense_1_CPU_CLOCK_FREQ_KHZ (CYDEV_CLK_FASTCLK__KHZ)
    #define CapSense_1_CPU_CLOCK_FREQ_MHZ (CYDEV_CLK_FASTCLK__MHZ)
#endif

/*******************************************************************************
* Enumeration types definition
*******************************************************************************/

/* Pin states */
#define CapSense_1_GROUND                                     (0u)
#define CapSense_1_HIGHZ                                      (1u)
#define CapSense_1_SHIELD                                     (2u)
#define CapSense_1_SENSOR                                     (3u)
#define CapSense_1_TX_PIN                                     (4u)
#define CapSense_1_RX_PIN                                     (5u)

#if (CapSense_1_ENABLE != CapSense_1_ADC_STANDALONE_EN)
/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/**
* \cond SECTION_CYSENSE_HIGH_LEVEL
* \addtogroup group_cysense_high_level
* \{
*/

cy_status CapSense_1_SetupWidget(uint32 widgetId);
cy_status CapSense_1_Scan(void);
cy_status CapSense_1_ScanAllWidgets(void);
uint32 CapSense_1_IsBusy(void);

/** \}
* \endcond */

/**
* \cond SECTION_CYSENSE_LOW_LEVEL
* \addtogroup group_cysense_low_level
* \{
*/

void CapSense_1_SetPinState(uint32 widgetId, uint32 sensorElement, uint32 state);

#if ((CapSense_1_ENABLE == CapSense_1_CSD_IDAC_AUTOCAL_EN) || \
     (CapSense_1_ENABLE == CapSense_1_CSX_IDAC_AUTOCAL_EN))
cy_status CapSense_1_CalibrateWidget(uint32 widgetId);
cy_status CapSense_1_CalibrateAllWidgets(void);
#endif /* ((CapSense_1_ENABLE == CapSense_1_CSD_IDAC_AUTOCAL_EN) || \
           (CapSense_1_ENABLE == CapSense_1_CSX_IDAC_AUTOCAL_EN)) */

/** \}
* \endcond */

/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/

cy_status CapSense_1_SsInitialize(void);
void CapSense_1_SsSetSnsClockDivider(uint32 snsClk);
void CapSense_1_SsSetSnsFirstPhaseWidth(uint32 phaseWidth);
void CapSense_1_SsSetClockDividers(uint32 snsClk, uint32 modClk);
void CapSense_1_SsIsrInitialize(cy_israddress address);
void CapSense_1_SsPostAllWidgetsScan(void);
void CapSense_1_SsSetIOsInDefaultState(void);

#if ((CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) || \
     (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) || \
     (CapSense_1_ENABLE == CapSense_1_ADC_EN))
    void CapSense_1_SsSwitchSensingMode(CapSense_1_SENSE_METHOD_ENUM mode);
#endif

#if (CapSense_1_CSD_SS_DIS != CapSense_1_CSD_AUTOTUNE)
    cy_status CapSense_1_SsAutoTune(void);
#endif

#if (CapSense_1_ENABLE == CapSense_1_MULTI_FREQ_SCAN_EN)
    void CapSense_1_SsChangeClkFreq(uint32 chId);
#endif

#if (CapSense_1_ENABLE == CapSense_1_ADC_EN)
    cy_status CapSense_1_SsReleaseResources(void);
#endif

#if((CapSense_1_ENABLE == CapSense_1_CSD_EN) || \
    (CapSense_1_ENABLE == CapSense_1_CSX_EN))
    void CapSense_1_SsInitializeSourceSenseClk(void);
#endif

#if (CapSense_1_ENABLE == CapSense_1_CSD_EN)
    void CapSense_1_SsClearCSDSensors(void);
    uint32 CapSense_1_SsCSDGetColSnsClkDivider(uint32 widgetId);
    void CapSense_1_SsCSDSetColSnsClkDivider(uint32 widgetId, uint32 dividerVal);

    #if ((CapSense_1_ENABLE == CapSense_1_CSD_MATRIX_WIDGET_EN) || \
         (CapSense_1_ENABLE == CapSense_1_CSD_TOUCHPAD_WIDGET_EN))
        uint32 CapSense_1_SsCSDGetRowSnsClkDivider(uint32 widgetId);
        void CapSense_1_SsCSDSetRowSnsClkDivider(uint32 widgetId, uint32 dividerVal);
    #endif

    #if (CapSense_1_CLK_SOURCE_PRSAUTO == CapSense_1_CSD_SNS_CLK_SOURCE)
        uint8 CapSense_1_SsCSDCalcPrsSize(uint32 snsClkDivider, uint32 resolution);
    #endif
#endif

void CapSense_1_BistDischargeExtCapacitors(void);

