swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.h
void CapSense_1_SetBusyFlags(uint32 flags);
void CapSense_1_ClrBusyFlags(uint32 flags);

/** \}
* \endcond */

/***************************************
* Global software/external variables
***************************************/
extern volatile uint8 CapSense_1_widgetIndex;
extern volatile uint8 CapSense_1_sensorIndex;
extern uint8 CapSense_1_requestScanAllWidget;

extern CapSense_1_RAM_SNS_STRUCT *CapSense_1_curRamSnsPtr;

#if ((CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) || \
     (CapSense_1_ENABLE == CapSense_1_ADC_EN))
    extern CapSense_1_SENSE_METHOD_ENUM CapSense_1_currentSenseMethod;
#endif

#if(CapSense_1_ENABLE == CapSense_1_MULTI_FREQ_SCAN_EN)
    extern uint8 CapSense_1_scanFreqIndex;
#else
    extern const uint8 CapSense_1_scanFreqIndex;
#endif

#if ((CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN) || \
     (CapSense_1_ENABLE == CapSense_1_CSX_EN))
    extern CapSense_1_FLASH_WD_STRUCT const *CapSense_1_curFlashWdgtPtr;
#endif

#if (CapSense_1_ENABLE == CapSense_1_CSD_GANGED_SNS_EN)
    /* Pointer to Flash structure holding info of sensor to be scanned */
    extern CapSense_1_FLASH_SNS_STRUCT const *CapSense_1_curFlashSnsPtr;
#endif

extern CapSense_1_FLASH_IO_STRUCT const *CapSense_1_curSnsIOPtr;

#endif /* (CapSense_1_ENABLE != CapSense_1_ADC_STANDALONE_EN) */

/****************************************************************************
* HW CSD Block Definition
****************************************************************************/
#define CapSense_1_CSD_HW                             ((CSD_Type*)CapSense_1_CSD__HW)

#define CapSense_1_CSD_CONFIG_REG                     ( CapSense_1_CSD_HW->CONFIG)
#define CapSense_1_CSD_CONFIG_PTR                     (&CapSense_1_CSD_HW->CONFIG)
#define CapSense_1_CSD_SPARE_REG                      ( CapSense_1_CSD_HW->SPARE)
#define CapSense_1_CSD_SPARE_PTR                      (&CapSense_1_CSD_HW->SPARE)
#define CapSense_1_CSD_STATUS_REG                     ( CapSense_1_CSD_HW->STATUS)
#define CapSense_1_CSD_STATUS_PTR                     (&CapSense_1_CSD_HW->STATUS)
#define CapSense_1_CSD_STAT_SEQ_REG                   ( CapSense_1_CSD_HW->STAT_SEQ)
#define CapSense_1_CSD_STAT_SEQ_PTR                   (&CapSense_1_CSD_HW->STAT_SEQ)
#define CapSense_1_CSD_STAT_CNTS_REG                  ( CapSense_1_CSD_HW->STAT_CNTS)
#define CapSense_1_CSD_STAT_CNTS_PTR                  (&CapSense_1_CSD_HW->STAT_CNTS)
#define CapSense_1_CSD_RESULT_VAL1_REG                ( CapSense_1_CSD_HW->RESULT_VAL1)
#define CapSense_1_CSD_RESULT_VAL1_PTR                (&CapSense_1_CSD_HW->RESULT_VAL1)
#define CapSense_1_CSD_RESULT_VAL2_REG                ( CapSense_1_CSD_HW->RESULT_VAL2)
#define CapSense_1_CSD_RESULT_VAL2_PTR                (&CapSense_1_CSD_HW->RESULT_VAL2)
#define CapSense_1_CSD_ADC_RES_REG                    ( CapSense_1_CSD_HW->ADC_RES)
#define CapSense_1_CSD_ADC_RES_PTR                    (&CapSense_1_CSD_HW->ADC_RES)
#define CapSense_1_CSD_INTR_REG                       ( CapSense_1_CSD_HW->INTR)
#define CapSense_1_CSD_INTR_PTR                       (&CapSense_1_CSD_HW->INTR)
#define CapSense_1_CSD_INTR_SET_REG                   ( CapSense_1_CSD_HW->INTR_SET)
#define CapSense_1_CSD_INTR_SET_PTR                   (&CapSense_1_CSD_HW->INTR_SET)
#define CapSense_1_CSD_INTR_MASK_REG                  ( CapSense_1_CSD_HW->INTR_MASK)
#define CapSense_1_CSD_INTR_MASK_PTR                  (&CapSense_1_CSD_HW->INTR_MASK)
#define CapSense_1_CSD_INTR_MASKED_REG                ( CapSense_1_CSD_HW->INTR_MASKED)
#define CapSense_1_CSD_INTR_MASKED_PTR                (&CapSense_1_CSD_HW->INTR_MASKED)
#define CapSense_1_CSD_HSCMP_REG                      ( CapSense_1_CSD_HW->HSCMP)
#define CapSense_1_CSD_HSCMP_PTR                      (&CapSense_1_CSD_HW->HSCMP)
#define CapSense_1_CSD_AMBUF_REG                      ( CapSense_1_CSD_HW->AMBUF)
#define CapSense_1_CSD_AMBUF_PTR                      (&CapSense_1_CSD_HW->AMBUF)
#define CapSense_1_CSD_REFGEN_REG                     ( CapSense_1_CSD_HW->REFGEN)
#define CapSense_1_CSD_REFGEN_PTR                     (&CapSense_1_CSD_HW->REFGEN)
#define CapSense_1_CSD_CSDCMP_REG                     ( CapSense_1_CSD_HW->CSDCMP)
#define CapSense_1_CSD_CSDCMP_PTR                     (&CapSense_1_CSD_HW->CSDCMP)
#define CapSense_1_CSD_SW_RES_REG                     ( CapSense_1_CSD_HW->SW_RES)
#define CapSense_1_CSD_SW_RES_PTR                     (&CapSense_1_CSD_HW->SW_RES)
#define CapSense_1_CSD_SENSE_PERIOD_REG               ( CapSense_1_CSD_HW->SENSE_PERIOD)
#define CapSense_1_CSD_SENSE_PERIOD_PTR               (&CapSense_1_CSD_HW->SENSE_PERIOD)
#define CapSense_1_CSD_SENSE_DUTY_REG                 ( CapSense_1_CSD_HW->SENSE_DUTY)
#define CapSense_1_CSD_SENSE_DUTY_PTR                 (&CapSense_1_CSD_HW->SENSE_DUTY)
#define CapSense_1_CSD_SW_HS_P_SEL_REG                ( CapSense_1_CSD_HW->SW_HS_P_SEL)
#define CapSense_1_CSD_SW_HS_P_SEL_PTR                (&CapSense_1_CSD_HW->SW_HS_P_SEL)
#define CapSense_1_CSD_SW_HS_N_SEL_REG                ( CapSense_1_CSD_HW->SW_HS_N_SEL)
#define CapSense_1_CSD_SW_HS_N_SEL_PTR                (&CapSense_1_CSD_HW->SW_HS_N_SEL)
#define CapSense_1_CSD_SW_SHIELD_SEL_REG              ( CapSense_1_CSD_HW->SW_SHIELD_SEL)
#define CapSense_1_CSD_SW_SHIELD_SEL_PTR              (&CapSense_1_CSD_HW->SW_SHIELD_SEL)
#define CapSense_1_CSD_SW_AMUXBUF_SEL_REG             ( CapSense_1_CSD_HW->SW_AMUXBUF_SEL)
#define CapSense_1_CSD_SW_AMUXBUF_SEL_PTR             (&CapSense_1_CSD_HW->SW_AMUXBUF_SEL)
#define CapSense_1_CSD_SW_BYP_SEL_REG                 ( CapSense_1_CSD_HW->SW_BYP_SEL)
#define CapSense_1_CSD_SW_BYP_SEL_PTR                 (&CapSense_1_CSD_HW->SW_BYP_SEL)
#define CapSense_1_CSD_SW_CMP_P_SEL_REG               ( CapSense_1_CSD_HW->SW_CMP_P_SEL)
#define CapSense_1_CSD_SW_CMP_P_SEL_PTR               (&CapSense_1_CSD_HW->SW_CMP_P_SEL)
#define CapSense_1_CSD_SW_CMP_N_SEL_REG               ( CapSense_1_CSD_HW->SW_CMP_N_SEL)
#define CapSense_1_CSD_SW_CMP_N_SEL_PTR               (&CapSense_1_CSD_HW->SW_CMP_N_SEL)
#define CapSense_1_CSD_SW_REFGEN_SEL_REG              ( CapSense_1_CSD_HW->SW_REFGEN_SEL)
#define CapSense_1_CSD_SW_REFGEN_SEL_PTR              (&CapSense_1_CSD_HW->SW_REFGEN_SEL)
#define CapSense_1_CSD_SW_FW_MOD_SEL_REG              ( CapSense_1_CSD_HW->SW_FW_MOD_SEL)
#define CapSense_1_CSD_SW_FW_MOD_SEL_PTR              (&CapSense_1_CSD_HW->SW_FW_MOD_SEL)
#define CapSense_1_CSD_SW_FW_TANK_SEL_REG             ( CapSense_1_CSD_HW->SW_FW_TANK_SEL)
#define CapSense_1_CSD_SW_FW_TANK_SEL_PTR             (&CapSense_1_CSD_HW->SW_FW_TANK_SEL)
#define CapSense_1_CSD_SW_DSI_SEL_REG                 ( CapSense_1_CSD_HW->SW_DSI_SEL)
#define CapSense_1_CSD_SW_DSI_SEL_PTR                 (&CapSense_1_CSD_HW->SW_DSI_SEL)
#define CapSense_1_CSD_IO_SEL_REG                     ( CapSense_1_CSD_HW->IO_SEL)
#define CapSense_1_CSD_IO_SEL_PTR                     (&CapSense_1_CSD_HW->IO_SEL)
#define CapSense_1_CSD_SEQ_TIME_REG                   ( CapSense_1_CSD_HW->SEQ_TIME)
#define CapSense_1_CSD_SEQ_TIME_PTR                   (&CapSense_1_CSD_HW->SEQ_TIME)
#define CapSense_1_CSD_SEQ_INIT_CNT_REG               ( CapSense_1_CSD_HW->SEQ_INIT_CNT)
#define CapSense_1_CSD_SEQ_INIT_CNT_PTR               (&CapSense_1_CSD_HW->SEQ_INIT_CNT)
#define CapSense_1_CSD_SEQ_NORM_CNT_REG               ( CapSense_1_CSD_HW->SEQ_NORM_CNT)
#define CapSense_1_CSD_SEQ_NORM_CNT_PTR               (&CapSense_1_CSD_HW->SEQ_NORM_CNT)
#define CapSense_1_CSD_ADC_CTL_REG                    ( CapSense_1_CSD_HW->ADC_CTL)
#define CapSense_1_CSD_ADC_CTL_PTR                    (&CapSense_1_CSD_HW->ADC_CTL)
#define CapSense_1_CSD_SEQ_START_REG                  ( CapSense_1_CSD_HW->SEQ_START)
#define CapSense_1_CSD_SEQ_START_PTR                  (&CapSense_1_CSD_HW->SEQ_START)
#define CapSense_1_CSD_IDACA_REG                      ( CapSense_1_CSD_HW->IDACA)
#define CapSense_1_CSD_IDACA_PTR                      (&CapSense_1_CSD_HW->IDACA)
#define CapSense_1_CSD_IDACB_REG                      ( CapSense_1_CSD_HW->IDACB)
#define CapSense_1_CSD_IDACB_PTR                      (&CapSense_1_CSD_HW->IDACB)

/****************************************************************************
* HW CSD Waveform Selection values
****************************************************************************/

#define CapSense_1_CSD_WAVEFORM_STATIC_OPEN           (0x00000000uL)
#define CapSense_1_CSD_WAVEFORM_STATIC_CLOSED         (0x00000001uL)
#define CapSense_1_CSD_WAVEFORM_PHI1                  (0x00000002uL)
#define CapSense_1_CSD_WAVEFORM_PHI2                  (0x00000003uL)
#define CapSense_1_CSD_WAVEFORM_PHI1_HSCMP            (0x00000004uL)
#define CapSense_1_CSD_WAVEFORM_PHI2_HSCMP            (0x00000005uL)
#define CapSense_1_CSD_WAVEFORM_HSCMP                 (0x00000006uL)
#define CapSense_1_CSD_WAVEFORM_SENSE_INV             (0x00000007uL)
#define CapSense_1_CSD_WAVEFORM_PHI1_DELAY            (0x00000008uL)
#define CapSense_1_CSD_WAVEFORM_PHI2_DELAY            (0x00000009uL)
#define CapSense_1_CSD_WAVEFORM_PHI1_INV              (0x0000000AuL)
#define CapSense_1_CSD_WAVEFORM_PHI2_INV              (0x0000000BuL)
#define CapSense_1_CSD_WAVEFORM_PHI1_HSCMP_INV        (0x0000000CuL)
#define CapSense_1_CSD_WAVEFORM_PHI2_HSCMP_INV        (0x0000000DuL)
#define CapSense_1_CSD_WAVEFORM_HSCMP_INV             (0x0000000EuL)
#define CapSense_1_CSD_WAVEFORM_SENSE                 (0x0000000FuL)

/****************************************************************************
* HW CSD Block Register Mask Definition
****************************************************************************/

/* CSD_CONFIG register masks */
#define CapSense_1_CSD_CONFIG_IREF_SEL_MSK                    (CSD_CONFIG_IREF_SEL_Msk)
#define CapSense_1_CSD_CONFIG_FILTER_DELAY_2_CYCLES           (0x00000002Lu)
#define CapSense_1_CSD_CONFIG_FILTER_DELAY_3_CYCLES           (0x00000003Lu)
#define CapSense_1_CSD_CONFIG_FILTER_DELAY_4_CYCLES           (0x00000004Lu)
#define CapSense_1_CSD_CONFIG_FILTER_DELAY_POS                (CSD_CONFIG_FILTER_DELAY_Pos)
#define CapSense_1_CSD_CONFIG_FILTER_DELAY_MSK                (CSD_CONFIG_FILTER_DELAY_Msk)
#define CapSense_1_CSD_CONFIG_FILTER_DELAY_12MHZ              (CapSense_1_CSD_CONFIG_FILTER_DELAY_2_CYCLES << CSD_CONFIG_FILTER_DELAY_Pos)
#define CapSense_1_CSD_CONFIG_FILTER_DELAY_24MHZ              (CapSense_1_CSD_CONFIG_FILTER_DELAY_3_CYCLES << CSD_CONFIG_FILTER_DELAY_Pos)
#define CapSense_1_CSD_CONFIG_FILTER_DELAY_48MHZ              (CapSense_1_CSD_CONFIG_FILTER_DELAY_4_CYCLES << CSD_CONFIG_FILTER_DELAY_Pos)
#define CapSense_1_CSD_CONFIG_SHIELD_DELAY_MSK                (CSD_CONFIG_SHIELD_DELAY_Msk)
#define CapSense_1_CSD_CONFIG_SHIELD_DELAY_POS                (CSD_CONFIG_SHIELD_DELAY_Pos)
#define CapSense_1_CSD_CONFIG_SENSE_EN_MSK                    (CSD_CONFIG_SENSE_EN_Msk)
#define CapSense_1_CSD_CONFIG_DSI_COUNT_SEL_POS               (CSD_CONFIG_DSI_COUNT_SEL_Pos)
#define CapSense_1_CSD_CONFIG_DSI_COUNT_SEL_MSK               (CSD_CONFIG_DSI_COUNT_SEL_Msk)
#define CapSense_1_CSD_CONFIG_SAMPLE_SYNC_MSK                 (CSD_CONFIG_SAMPLE_SYNC_Msk)
#define CapSense_1_CSD_CONFIG_ENABLE_MSK                      (CSD_CONFIG_ENABLE_Msk)

/* CSD_STAT_SEQ register masks */
#define CapSense_1_CSD_STAT_SEQ_SEQ_STATE_MSK                 (CSD_STAT_SEQ_SEQ_STATE_Msk)
#define CapSense_1_ADC_STAT_SEQ_SEQ_STATE_MSK                 (CSD_STAT_SEQ_ADC_STATE_Msk)

/* CSD_RESULT_VAL1 register masks */
#define CapSense_1_CSD_RESULT_VAL1_VALUE_MSK                  (CSD_RESULT_VAL1_VALUE_Msk)
#define CapSense_1_CSD_RESULT_VAL1_BAD_CONVS_MSK              (CSD_RESULT_VAL1_BAD_CONVS_Msk)
#define CapSense_1_CSD_RESULT_VAL1_BAD_CONVS_POS              (CSD_RESULT_VAL1_BAD_CONVS_Pos)

/* CSD_RESULT_VAL2 register masks */
#define CapSense_1_CSD_RESULT_VAL2_VALUE_MSK                  (CSD_RESULT_VAL2_VALUE_Msk)

/* CSD_INTR register masks */
#define CapSense_1_CSD_INTR_SAMPLE_MSK                        (CSD_INTR_SAMPLE_Msk)
#define CapSense_1_CSD_INTR_INIT_MSK                          (CSD_INTR_INIT_Msk)
#define CapSense_1_CSD_INTR_ADC_RES_MSK                       (CSD_INTR_ADC_RES_Msk)
#define CapSense_1_CSD_INTR_ALL_MSK                           (CSD_INTR_SAMPLE_Msk | CSD_INTR_INIT_Msk | CSD_INTR_ADC_RES_Msk)

/* CSD_INTR_MASK register masks */
#define CapSense_1_CSD_INTR_MASK_SAMPLE_MSK                   (CSD_INTR_MASK_SAMPLE_Msk)
#define CapSense_1_CSD_INTR_MASK_INIT_MSK                     (CSD_INTR_MASK_INIT_Msk)
#define CapSense_1_CSD_INTR_MASK_ADC_RES_MSK                  (CSD_INTR_MASK_ADC_RES_Msk)
#define CapSense_1_CSD_INTR_MASK_CLEAR_MSK                    (0uL)

/* CSD_HSCMP register masks */
#define CapSense_1_CSD_HSCMP_HSCMP_EN_MSK                     (CSD_HSCMP_HSCMP_EN_Msk)
#define CapSense_1_CSD_HSCMP_HSCMP_INVERT_MSK                 (CSD_HSCMP_HSCMP_INVERT_Msk)
#define CapSense_1_CSD_HSCMP_AZ_EN_MSK                        (CSD_HSCMP_AZ_EN_Msk)

