swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.h
/* CSD_AMBUF register masks */
#define CapSense_1_CSD_AMBUF_PWR_MODE_OFF                     (0uL)
#define CapSense_1_CSD_AMBUF_PWR_MODE_NORM                    (1uL)
#define CapSense_1_CSD_AMBUF_PWR_MODE_HI                      (2uL)

/* CSD_REFGEN register masks */
#define CapSense_1_CSD_REFGEN_REFGEN_EN_MSK                   (CSD_REFGEN_REFGEN_EN_Msk)
#define CapSense_1_CSD_REFGEN_BYPASS_MSK                      (CSD_REFGEN_BYPASS_Msk)
#define CapSense_1_CSD_REFGEN_VDDA_EN_MSK                     (CSD_REFGEN_VDDA_EN_Msk)
#define CapSense_1_CSD_REFGEN_RES_EN_MSK                      (CSD_REFGEN_RES_EN_Msk)
#define CapSense_1_CSD_REFGEN_GAIN_POS                        (CSD_REFGEN_GAIN_Pos)
#define CapSense_1_CSD_REFGEN_GAIN_MSK                        (CSD_REFGEN_GAIN_Msk)
#define CapSense_1_CSD_REFGEN_VREFLO_SEL_MSK                  (CSD_REFGEN_VREFLO_SEL_Msk)
#define CapSense_1_CSD_REFGEN_VREFLO_INT_MSK                  (CSD_REFGEN_VREFLO_INT_Msk)

#define CapSense_1_VREF_HI_OVERSHOOT_CORRECTION               (0x00000001uL)

#if(CapSense_1_ENABLE != CapSense_1_LP_MODE_EN)
    #define CapSense_1_DEFAULT_CSD_REFGEN_RES_CFG             (CapSense_1_CSD_REFGEN_RES_EN_MSK)
#else
    #define CapSense_1_DEFAULT_CSD_REFGEN_RES_CFG             (0u)
#endif /* (CapSense_1_ENABLE != CapSense_1_LP_MODE_EN) */

#define CapSense_1_DEFAULT_CSD_REFGEN_GAIN                    (CapSense_1_CSD_GAIN << CSD_REFGEN_GAIN_Pos)
#define CapSense_1_DEFAULT_CSD_REFGEN_VREFLO_SEL              (((CSD_REFGEN_VREFLO_SEL_Msk >> CSD_REFGEN_VREFLO_SEL_Pos) - CapSense_1_VREF_HI_OVERSHOOT_CORRECTION) <<  CSD_REFGEN_VREFLO_SEL_Pos)
#define CapSense_1_CSD_REFGEN_NO_SHIELD_CFG                   (CapSense_1_CSD_REFGEN_REFGEN_EN_MSK | CapSense_1_DEFAULT_CSD_REFGEN_RES_CFG | CapSense_1_DEFAULT_CSD_REFGEN_GAIN)
#define CapSense_1_CSD_REFGEN_WITH_SHIELD_CFG                 (CapSense_1_CSD_REFGEN_REFGEN_EN_MSK | CapSense_1_CSD_REFGEN_RES_EN_MSK | CapSense_1_DEFAULT_CSD_REFGEN_GAIN)

/* CSD_CSDCMP register masks */
#define CapSense_1_CSD_CSDCMP_CSDCMP_DISABLED                 (0uL)
#define CapSense_1_CSD_CSDCMP_CSDCMP_EN_MSK                   (CSD_CSDCMP_CSDCMP_EN_Msk)
#define CapSense_1_CSD_CSDCMP_CMP_PHASE_FULL                  (0uL << CSD_CSDCMP_CMP_PHASE_Pos)
#define CapSense_1_CSD_CSDCMP_CMP_PHASE_PHI1                  (1uL << CSD_CSDCMP_CMP_PHASE_Pos)
#define CapSense_1_CSD_CSDCMP_CMP_PHASE_PHI2                  (2uL << CSD_CSDCMP_CMP_PHASE_Pos)
#define CapSense_1_CSD_CSDCMP_CMP_PHASE_PHI1_2                (3uL << CSD_CSDCMP_CMP_PHASE_Pos)
#define CapSense_1_CSD_CSDCMP_AZ_EN_MSK                       (CSD_CSDCMP_AZ_EN_Msk)

/* CSD_SENSE_PERIOD register masks */
#define CapSense_1_CSD_SENSE_PERIOD_SENSE_DIV_MSK             (CSD_SENSE_PERIOD_SENSE_DIV_Msk)
#define CapSense_1_CSD_SENSE_PERIOD_LFSR_SIZE_MSK             (CSD_SENSE_PERIOD_LFSR_SIZE_Msk)
#define CapSense_1_CSD_SENSE_PERIOD_LFSR_SIZE_POS             (CSD_SENSE_PERIOD_LFSR_SIZE_Pos)
#define CapSense_1_CSD_SENSE_PERIOD_LFSR_SCALE_MSK            (CSD_SENSE_PERIOD_LFSR_SCALE_Msk)
#define CapSense_1_CSD_SENSE_PERIOD_LFSR_CLEAR_MSK            (CSD_SENSE_PERIOD_LFSR_CLEAR_Msk)
#define CapSense_1_CSD_SENSE_PERIOD_SEL_LFSR_MSB_MSK          (CSD_SENSE_PERIOD_SEL_LFSR_MSB_Msk)
#define CapSense_1_CSD_SENSE_PERIOD_LFSR_BITS_MSK             (CSD_SENSE_PERIOD_LFSR_BITS_Msk)

/* CSD_SENSE_DUTY register masks */
#define CapSense_1_CSD_SENSE_DUTY_SENSE_WIDTH_MSK             (CSD_SENSE_DUTY_SENSE_WIDTH_Msk)
#define CapSense_1_CSD_SENSE_DUTY_SENSE_POL_MSK               (CSD_SENSE_DUTY_SENSE_POL_Msk)
#define CapSense_1_CSD_SENSE_DUTY_SENSE_POL_PHI_LOW           (0uL)
#define CapSense_1_CSD_SENSE_DUTY_SENSE_POL_PHI_HIGH          (CSD_SENSE_DUTY_SENSE_POL_Msk)
#define CapSense_1_CSD_SENSE_DUTY_OVERLAP_PHI1_MSK            (CSD_SENSE_DUTY_OVERLAP_PHI1_Msk)
#define CapSense_1_CSD_SENSE_DUTY_OVERLAP_PHI2_MSK            (CSD_SENSE_DUTY_OVERLAP_PHI2_Msk)

#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_OPEN        (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMPM_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE       (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMPM_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_OPEN        (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMPT_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE       (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMPT_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_OPEN        (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMPS_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE       (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMPS_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMMA_STATIC_OPEN        (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMMA_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMMA_STATIC_CLOSE       (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMMA_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_OPEN        (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMMB_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE       (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMMB_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMRH_STATIC_OPEN        (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMRH_Pos)
#define CapSense_1_CSD_SW_HS_P_SEL_SW_HMRH_STATIC_CLOSE       (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMRH_Pos)

#define CapSense_1_CSD_SW_HS_N_SEL_SW_HCRH_STATIC_OPEN        (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_N_SEL_SW_HCRH_Pos)
#define CapSense_1_CSD_SW_HS_N_SEL_SW_HCRH_STATIC_CLOSE       (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_N_SEL_SW_HCRH_Pos)
#define CapSense_1_CSD_SW_HS_N_SEL_SW_HCRL_STATIC_OPEN        (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_N_SEL_SW_HCRL_Pos)
#define CapSense_1_CSD_SW_HS_N_SEL_SW_HCRL_STATIC_CLOSE       (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_N_SEL_SW_HCRL_Pos)
#define CapSense_1_CSD_SW_HS_N_SEL_SW_HCCD_STATIC_OPEN        (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_N_SEL_SW_HCCD_Pos)
#define CapSense_1_CSD_SW_HS_N_SEL_SW_HCCD_STATIC_CLOSE       (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_N_SEL_SW_HCCD_Pos)

#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAV_HSCMP            (CapSense_1_CSD_WAVEFORM_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAV_PHI1             (CapSense_1_CSD_WAVEFORM_PHI1 << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAV_PHI2             (CapSense_1_CSD_WAVEFORM_PHI2 << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAV_PHI1_HSCMP       (CapSense_1_CSD_WAVEFORM_PHI1_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAV_PHI2_HSCMP       (CapSense_1_CSD_WAVEFORM_PHI2_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAV_STATIC_OPEN      (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAV_STATIC_CLOSE     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)

#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAG_HSCMP            (CapSense_1_CSD_WAVEFORM_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAG_PHI1             (CapSense_1_CSD_WAVEFORM_PHI1 << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAG_PHI2             (CapSense_1_CSD_WAVEFORM_PHI2 << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAG_PHI1_HSCMP       (CapSense_1_CSD_WAVEFORM_PHI1_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAG_PHI2_HSCMP       (CapSense_1_CSD_WAVEFORM_PHI2_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAG_STATIC_OPEN      (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCAG_STATIC_CLOSE     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)

#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBV_HSCMP            (CapSense_1_CSD_WAVEFORM_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBV_PHI1             (CapSense_1_CSD_WAVEFORM_PHI1 << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBV_PHI2             (CapSense_1_CSD_WAVEFORM_PHI2 << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBV_PHI1_HSCMP       (CapSense_1_CSD_WAVEFORM_PHI1_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBV_PHI2_HSCMP       (CapSense_1_CSD_WAVEFORM_PHI2_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBV_STATIC_OPEN      (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBV_STATIC_CLOSE      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)

#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBG_HSCMP            (CapSense_1_CSD_WAVEFORM_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBG_PHI1             (CapSense_1_CSD_WAVEFORM_PHI1 << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBG_PHI2             (CapSense_1_CSD_WAVEFORM_PHI2 << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBG_PHI1_HSCMP       (CapSense_1_CSD_WAVEFORM_PHI1_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBG_PHI2_HSCMP       (CapSense_1_CSD_WAVEFORM_PHI2_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBG_STATIC_OPEN      (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define CapSense_1_CSD_SW_SHIELD_SEL_SW_HCBG_STATIC_CLOSE      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)

#define CapSense_1_CSD_SW_AMUXBUF_SEL_SW_IRLB_STATIC_CLOSE    (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_AMUXBUF_SEL_SW_IRLB_Pos)
#define CapSense_1_CSD_SW_AMUXBUF_SEL_SW_IRH_STATIC_CLOSE     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_AMUXBUF_SEL_SW_IRH_Pos)
#define CapSense_1_CSD_SW_AMUXBUF_SEL_SW_ICB_PHI2             (CapSense_1_CSD_WAVEFORM_PHI2 << CSD_SW_AMUXBUF_SEL_SW_ICB_Pos)
#define CapSense_1_CSD_SW_AMUXBUF_SEL_SW_DEFAULT              (CapSense_1_CSD_WAVEFORM_STATIC_OPEN)

/* CSD_SW_BYP_SEL register masks */
#define CapSense_1_CSD_SW_BYP_SEL_SW_BYA_MSK                  (CSD_SW_BYP_SEL_SW_BYA_Msk)
#define CapSense_1_CSD_SW_BYP_SEL_SW_BYB_MSK                  (CSD_SW_BYP_SEL_SW_BYB_Msk)

#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFPM_STATIC_OPEN       (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_P_SEL_SW_SFPM_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFPM_STATIC_CLOSE      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_P_SEL_SW_SFPM_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFPT_STATIC_OPEN       (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_P_SEL_SW_SFPT_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFPT_STATIC_CLOSE      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_P_SEL_SW_SFPT_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFPS_STATIC_OPEN       (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_P_SEL_SW_SFPS_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFPS_STATIC_CLOSE      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_P_SEL_SW_SFPS_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFMA_STATIC_OPEN       (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_P_SEL_SW_SFMA_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFMA_STATIC_CLOSE      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_P_SEL_SW_SFMA_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFCA_STATIC_OPEN       (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_P_SEL_SW_SFCA_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFCA_STATIC_CLOSE      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_P_SEL_SW_SFCA_Pos)
#define CapSense_1_CSD_SW_CMP_P_SEL_SW_SFCA_MSK               (CSD_SW_CMP_P_SEL_SW_SFCA_Msk)

#define CapSense_1_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_OPEN       (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_N_SEL_SW_SCRH_Pos)
#define CapSense_1_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_CLOSE      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_N_SEL_SW_SCRH_Pos)
#define CapSense_1_CSD_SW_CMP_N_SEL_SW_SCRL_STATIC_OPEN       (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_N_SEL_SW_SCRL_Pos)
#define CapSense_1_CSD_SW_CMP_N_SEL_SW_SCRL_STATIC_CLOSE      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_N_SEL_SW_SCRL_Pos)

