swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.h
/* CSD_SW_REFGEN_SEL register masks */
#define CapSense_1_CSD_SW_REFGEN_SEL_SW_IAIB_MSK              (CSD_SW_REFGEN_SEL_SW_IAIB_Msk)
#define CapSense_1_CSD_SW_REFGEN_SEL_SW_IBCB_MSK              (CSD_SW_REFGEN_SEL_SW_IBCB_Msk)
#define CapSense_1_CSD_SW_REFGEN_SEL_SW_SGMB_MSK              (CSD_SW_REFGEN_SEL_SW_SGMB_Msk)
#define CapSense_1_CSD_SW_REFGEN_SEL_SW_SGRP_MSK              (CSD_SW_REFGEN_SEL_SW_SGRP_Msk)
#define CapSense_1_CSD_SW_REFGEN_SEL_SW_SGRE_MSK              (CSD_SW_REFGEN_SEL_SW_SGRE_Msk)
#define CapSense_1_CSD_SW_REFGEN_SEL_SW_SGR_MSK               (CSD_SW_REFGEN_SEL_SW_SGR_Msk)

#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_F1PM_MSK              (CSD_SW_FW_MOD_SEL_SW_F1PM_Msk)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_F1PM_STATIC_CLOSE     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_F1PM_Pos)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_F1MA_MSK              (CSD_SW_FW_MOD_SEL_SW_F1MA_Msk)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_F1MA_STATIC_CLOSE     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_F1MA_Pos)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_F1CA_MSK              (CSD_SW_FW_MOD_SEL_SW_F1CA_Msk)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_F1CA_STATIC_CLOSE     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_F1CA_Pos)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_F1CA_PHI2             (CapSense_1_CSD_WAVEFORM_PHI2 << CSD_SW_FW_MOD_SEL_SW_F1CA_Pos)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_C1CC_STATIC_OPEN      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_C1CC_Pos)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_C1CC_STATIC_CLOSE     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_C1CC_Pos)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_C1CD_STATIC_OPEN      (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_C1CD_Pos)
#define CapSense_1_CSD_SW_FW_MOD_SEL_SW_C1CD_STATIC_CLOSE     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_C1CD_Pos)

#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2PT_MSK             (CSD_SW_FW_TANK_SEL_SW_F2PT_Msk)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE    (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2PT_Pos)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2MA_MSK             (CSD_SW_FW_TANK_SEL_SW_F2MA_Msk)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2MA_STATIC_CLOSE    (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2MA_Pos)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2CA_MSK             (CSD_SW_FW_TANK_SEL_SW_F2CA_Msk)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2CA_STATIC_CLOSE    (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2CA_Pos)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2CB_MSK             (CSD_SW_FW_TANK_SEL_SW_F2CB_Msk)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2CB_STATIC_CLOSE    (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2CB_Pos)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2CA_PHI2            (CapSense_1_CSD_WAVEFORM_PHI2 << CSD_SW_FW_TANK_SEL_SW_F2CA_Pos)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_F2CB_PHI2            (CapSense_1_CSD_WAVEFORM_PHI2 << CSD_SW_FW_TANK_SEL_SW_F2CB_Pos)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_C2CC_STATIC_OPEN     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_C2CC_Pos)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_C2CC_STATIC_CLOSE    (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_C2CC_Pos)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_C2CD_STATIC_OPEN     (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_C2CD_Pos)
#define CapSense_1_CSD_SW_FW_TANK_SEL_SW_C2CD_STATIC_CLOSE    (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_C2CD_Pos)

#define CapSense_1_CSD_TX_OUT_MSK                             (CSD_IO_SEL_CSD_TX_OUT_Msk)
#define CapSense_1_CSD_TX_OUT_STATIC_OPEN                     (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_IO_SEL_CSD_TX_OUT_Pos)

#define CapSense_1_CSD_TX_OUT_EN_MSK                          (CSD_IO_SEL_CSD_TX_OUT_EN_Msk)
#define CapSense_1_CSD_TX_OUT_EN_PHI1_DELAY                   (CapSense_1_CSD_WAVEFORM_PHI1_DELAY << 4u)
#define CapSense_1_CSD_TX_AMUXB_EN_MSK                        (CSD_IO_SEL_CSD_TX_AMUXB_EN_Msk)
#define CapSense_1_CSD_TX_AMUXB_EN_PHI2_DELAY                 (CapSense_1_CSD_WAVEFORM_PHI2_DELAY << 12u)
#define CapSense_1_CSD_TX_N_OUT_MSK                           (CSD_IO_SEL_CSD_TX_N_OUT_Msk)
#define CapSense_1_CSD_TX_N_OUT_STATIC_OPEN                   (CapSense_1_CSD_WAVEFORM_STATIC_OPEN << CSD_IO_SEL_CSD_TX_N_OUT_Pos)
#define CapSense_1_CSD_TX_N_OUT_STATIC_CLOSE                  (CapSense_1_CSD_WAVEFORM_STATIC_CLOSED << CSD_IO_SEL_CSD_TX_N_OUT_Pos)
#define CapSense_1_CSD_TX_N_OUT_EN_MSK                        (CSD_IO_SEL_CSD_TX_N_OUT_EN_Msk)
#define CapSense_1_CSD_TX_N_OUT_EN_PHI1                       (CapSense_1_CSD_WAVEFORM_PHI1 << CSD_IO_SEL_CSD_TX_N_OUT_EN_Pos)
#define CapSense_1_CSD_TX_N_AMUXA_EN_MSK                      (CSD_IO_SEL_CSD_TX_N_AMUXA_EN_Msk)
#define CapSense_1_CSD_TX_N_AMUXA_EN_PHI2                     (CapSense_1_CSD_WAVEFORM_PHI2 << CSD_IO_SEL_CSD_TX_N_AMUXA_EN_Pos)

/* IDACB used */
#if ((CapSense_1_ENABLE == CapSense_1_CSD_IDAC_COMP_EN) && \
     (CapSense_1_ENABLE == CapSense_1_CSD_DEDICATED_IDAC_COMP_EN))
        #define CapSense_1_IDACB_USED                         (1u)
#else
        #define CapSense_1_IDACB_USED                         (0u)
#endif /* ((CapSense_1_ENABLE == CapSense_1_CSD_IDAC_COMP_EN) && \
           (CapSense_1_ENABLE == CapSense_1_CSD_DEDICATED_IDAC_COMP_EN)) */

/* CSD_SEQ_INIT_CNT register masks */
#define CapSense_1_CSD_SEQ_INIT_CNT_CONV_CNT_MSK              (CSD_SEQ_INIT_CNT_CONV_CNT_Msk)

/* CSD_SEQ_NORM_CNT register masks */
#define CapSense_1_CSD_SEQ_NORM_CNT_CONV_CNT_MSK              (CSD_SEQ_NORM_CNT_CONV_CNT_Msk)

/* CSD_SEQ_START register masks */
#define CapSense_1_CSD_SEQ_START_START_MSK                    (CSD_SEQ_START_START_Msk)
#define CapSense_1_CSD_SEQ_START_SEQ_MODE_MSK                 (CSD_SEQ_START_SEQ_MODE_Msk)
#define CapSense_1_CSD_SEQ_START_ABORT_MSK                    (CSD_SEQ_START_ABORT_Msk)
#define CapSense_1_CSD_SEQ_START_DSI_START_EN_MSK             (CSD_SEQ_START_DSI_START_EN_Msk)
#define CapSense_1_CSD_SEQ_START_AZ0_SKIP_MSK                 (CSD_SEQ_START_AZ0_SKIP_Msk)
#define CapSense_1_CSD_SEQ_START_AZ1_SKIP_MSK                 (CSD_SEQ_START_AZ1_SKIP_Msk)

/* CSD_IDACA register masks */
#define CapSense_1_CSD_IDACA_VAL_MSK                          (CSD_IDACA_VAL_Msk)
#define CapSense_1_CSD_IDACA_VAL_POS                          (CSD_IDACA_VAL_Pos)

#define CapSense_1_CSD_IDACA_POL_DYN_MSK                      (CSD_IDACA_POL_DYN_Msk)
#define CapSense_1_CSD_IDACA_POL_DYN_POS                      (CSD_IDACA_POL_DYN_Pos)

#define CapSense_1_CSD_IDACA_POLARITY_MSK                     (CSD_IDACA_POLARITY_Msk)
#define CapSense_1_CSD_IDACA_POLARITY_POS                     (CSD_IDACA_POLARITY_Pos)
#define CapSense_1_CSD_IDACA_POLARITY_VSSA_SRC                (0uL)
#define CapSense_1_CSD_IDACA_POLARITY_VDDA_SNK                (1uL)
#define CapSense_1_CSD_IDACA_POLARITY_SENSE                   (2uL)
#define CapSense_1_CSD_IDACA_POLARITY_SENSE_INV               (3uL)

#define CapSense_1_CSD_IDACA_BALL_MODE_MSK                    (CSD_IDACA_BAL_MODE_Msk)
#define CapSense_1_CSD_IDACA_BALL_MODE_POS                    (CSD_IDACA_BAL_MODE_Pos)
#define CapSense_1_CSD_IDACA_BALL_MODE_FULL                   (0uL)
#define CapSense_1_CSD_IDACA_BALL_MODE_PHI1                   (1uL)
#define CapSense_1_CSD_IDACA_BALL_MODE_PHI2                   (2uL)
#define CapSense_1_CSD_IDACA_BALL_MODE_PHI1_2                 (3uL)

