swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.h
#define CapSense_1_CSD_IDACA_LEG1_MODE_MSK                    (CSD_IDACA_LEG1_MODE_Msk)
#define CapSense_1_CSD_IDACA_LEG1_MODE_POS                    (CSD_IDACA_LEG1_MODE_Pos)
#define CapSense_1_CSD_IDACA_LEG1_MODE_GP_STATIC              (0uL)
#define CapSense_1_CSD_IDACA_LEG1_MODE_GP                     (1uL)
#define CapSense_1_CSD_IDACA_LEG1_MODE_CSD_STATIC             (2uL)
#define CapSense_1_CSD_IDACA_LEG1_MODE_CSD                    (3uL)

#define CapSense_1_CSD_IDACA_LEG2_MODE_MSK                    (CSD_IDACA_LEG2_MODE_Msk)
#define CapSense_1_CSD_IDACA_LEG2_MODE_POS                    (CSD_IDACA_LEG2_MODE_Pos)
#define CapSense_1_CSD_IDACA_LEG2_MODE_GP_STATIC              (0uL)
#define CapSense_1_CSD_IDACA_LEG2_MODE_GP                     (1uL)
#define CapSense_1_CSD_IDACA_LEG2_MODE_CSD_STATIC             (2uL)
#define CapSense_1_CSD_IDACA_LEG2_MODE_CSD                    (3uL)

#define CapSense_1_CSD_IDACA_RANGE_MSK                        (CSD_IDACA_RANGE_Msk)
#define CapSense_1_CSD_IDACA_RANGE_POS                        (CSD_IDACA_RANGE_Pos)
#define CapSense_1_CSD_IDACA_RANGE_IDAC_LO                    (0uL)
#define CapSense_1_CSD_IDACA_RANGE_IDAC_MED                   (1uL)
#define CapSense_1_CSD_IDACA_RANGE_IDAC_HI                    (2uL)

#define CapSense_1_CSD_IDACA_LEG1_EN_MSK                      (CSD_IDACA_LEG1_EN_Msk)
#define CapSense_1_CSD_IDACA_LEG2_EN_MSK                      (CSD_IDACA_LEG2_EN_Msk)

/* CSD_IDACB register masks */
#define CapSense_1_CSD_IDACB_VAL_MSK                          (CSD_IDACB_VAL_Msk)
#define CapSense_1_CSD_IDACB_VAL_POS                          (CSD_IDACB_VAL_Pos)

#define CapSense_1_CSD_IDACB_POL_DYN_MSK                      (CSD_IDACB_POL_DYN_Msk)
#define CapSense_1_CSD_IDACB_POL_DYN_POS                      (CSD_IDACB_POL_DYN_Pos)
#define CapSense_1_CSD_IDACB_POL_DYN_STATIC                   (0uL)
#define CapSense_1_CSD_IDACB_POL_DYN_DYNAMIC                  (1uL)

#define CapSense_1_CSD_IDACB_POLARITY_MSK                     (CSD_IDACB_POLARITY_Msk)
#define CapSense_1_CSD_IDACB_POLARITY_POS                     (CSD_IDACB_POLARITY_Pos)
#define CapSense_1_CSD_IDACB_POLARITY_VSSA_SRC                (0uL)
#define CapSense_1_CSD_IDACB_POLARITY_VDDA_SNK                (1uL)
#define CapSense_1_CSD_IDACB_POLARITY_SENSE                   (2uL)
#define CapSense_1_CSD_IDACB_POLARITY_SENSE_INV               (3uL)

#define CapSense_1_CSD_IDACB_BALL_MODE_MSK                    (CSD_IDACB_BAL_MODE_Msk)
#define CapSense_1_CSD_IDACB_BALL_MODE_POS                    (CSD_IDACB_BAL_MODE_Pos)
#define CapSense_1_CSD_IDACB_BALL_MODE_FULL                   (0uL)
#define CapSense_1_CSD_IDACB_BALL_MODE_PHI1                   (1uL)
#define CapSense_1_CSD_IDACB_BALL_MODE_PHI2                   (2uL)
#define CapSense_1_CSD_IDACB_BALL_MODE_PHI1_2                 (3uL)

#define CapSense_1_CSD_IDACB_LEG1_MODE_MSK                    (CSD_IDACB_LEG1_MODE_Msk)
#define CapSense_1_CSD_IDACB_LEG1_MODE_POS                    (CSD_IDACB_LEG1_MODE_Pos)
#define CapSense_1_CSD_IDACB_LEG1_MODE_GP_STATIC              (0uL)
#define CapSense_1_CSD_IDACB_LEG1_MODE_GP                     (1uL)
#define CapSense_1_CSD_IDACB_LEG1_MODE_CSD_STATIC             (2uL)
#define CapSense_1_CSD_IDACB_LEG1_MODE_CSD                    (3uL)

#define CapSense_1_CSD_IDACB_LEG2_MODE_MSK                    (CSD_IDACB_LEG2_MODE_Msk)
#define CapSense_1_CSD_IDACB_LEG2_MODE_POS                    (CSD_IDACB_LEG2_MODE_Pos)
#define CapSense_1_CSD_IDACB_LEG2_MODE_GP_STATIC              (0uL)
#define CapSense_1_CSD_IDACB_LEG2_MODE_GP                     (1uL)
#define CapSense_1_CSD_IDACB_LEG2_MODE_CSD_STATIC             (2uL)
#define CapSense_1_CSD_IDACB_LEG2_MODE_CSD                    (3uL)

#define CapSense_1_CSD_IDACB_RANGE_MSK                        (CSD_IDACB_RANGE_Msk)
#define CapSense_1_CSD_IDACB_RANGE_POS                        (CSD_IDACB_RANGE_Pos)
#define CapSense_1_CSD_IDACB_RANGE_IDAC_LO                    (0uL)
#define CapSense_1_CSD_IDACB_RANGE_IDAC_MED                   (1uL)
#define CapSense_1_CSD_IDACB_RANGE_IDAC_HI                    (2uL)

#define CapSense_1_CSD_IDACB_LEG1_EN_MSK                      (CSD_IDACB_LEG1_EN_Msk)
#define CapSense_1_CSD_IDACB_LEG2_EN_MSK                      (CSD_IDACB_LEG2_EN_Msk)
#define CapSense_1_CSD_IDACB_LEG3_EN_MSK                      (CSD_IDACB_LEG3_EN_Msk)

/***************************************
* PRS & LFSR masks
***************************************/
#define CapSense_1_LFSR_TABLE_SIZE                            (4u)

#define CapSense_1_PRS_LENGTH_2_BITS                          (0x00000003Lu)
#define CapSense_1_PRS_LENGTH_3_BITS                          (0x00000007Lu)
#define CapSense_1_PRS_LENGTH_4_BITS                          (0x0000000FLu)
#define CapSense_1_PRS_LENGTH_5_BITS                          (0x0000001FLu)
#define CapSense_1_PRS_LENGTH_8_BITS                          (0x000000FFLu)
#define CapSense_1_PRS_LENGTH_12_BITS                         (0x00000FFFLu)

#define CapSense_1_SNSCLK_SSC1_PERIOD                         (63u)
#define CapSense_1_SNSCLK_SSC2_PERIOD                         (127u)
#define CapSense_1_SNSCLK_SSC3_PERIOD                         (511u)
#define CapSense_1_SNSCLK_SSC4_PERIOD                         (1023u)

#define CapSense_1_SNSCLK_SSC1_RANGE                          (16u)
#define CapSense_1_SNSCLK_SSC2_RANGE                          (16u)
#define CapSense_1_SNSCLK_SSC3_RANGE                          (16u)
#define CapSense_1_SNSCLK_SSC4_RANGE                          (16u)

#define CapSense_1_LFSR_DITHER_PERCENTAGE                     (10uL)
#define CapSense_1_SNSCLK_SSC1_THRESHOLD                      (CapSense_1_LFSR_DITHER_PERCENTAGE * CapSense_1_SNSCLK_SSC1_RANGE)
#define CapSense_1_SNSCLK_SSC2_THRESHOLD                      (CapSense_1_LFSR_DITHER_PERCENTAGE * CapSense_1_SNSCLK_SSC2_RANGE)
#define CapSense_1_SNSCLK_SSC3_THRESHOLD                      (CapSense_1_LFSR_DITHER_PERCENTAGE * CapSense_1_SNSCLK_SSC3_RANGE)
#define CapSense_1_SNSCLK_SSC4_THRESHOLD                      (CapSense_1_LFSR_DITHER_PERCENTAGE * CapSense_1_SNSCLK_SSC4_RANGE)
#define CapSense_1_HFCLK_SNSCLK_FACTOR                        (160uL)

/* Clock register masks */
#define CapSense_1_MODCLK_CMD_DIV_SHIFT                       (0uL)
#define CapSense_1_MODCLK_CMD_PA_DIV_SHIFT                    (8uL)
#define CapSense_1_MODCLK_CMD_DISABLE_SHIFT                   (30uL)
#define CapSense_1_MODCLK_CMD_ENABLE_SHIFT                    (31uL)
#define CapSense_1_MODCLK_CMD_DISABLE_MASK                    ((uint32)(1uL << CapSense_1_MODCLK_CMD_DISABLE_SHIFT))
#define CapSense_1_MODCLK_CMD_ENABLE_MASK                     ((uint32)(1uL << CapSense_1_MODCLK_CMD_ENABLE_SHIFT))

