swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Sensing.h
#define CapSense_1_HSIOM_SEL_MASK                             (GPIO_HSIOM_MASK)
#define CapSense_1_HSIOM_SEL_GPIO                             (HSIOM_SEL_GPIO)
#define CapSense_1_HSIOM_SEL_CSD_SENSE                        (HSIOM_SEL_ACT_3)
#define CapSense_1_HSIOM_SEL_CSD_SHIELD                       (HSIOM_SEL_ACT_2)
#define CapSense_1_HSIOM_SEL_AMUXA                            (HSIOM_SEL_AMUXA)
#define CapSense_1_HSIOM_SEL_AMUXB                            (HSIOM_SEL_AMUXB)

/***************************************
* API Constants
***************************************/

#define CapSense_1_MOD_CSD_CLK_12MHZ                          (12000000uL)
#define CapSense_1_MOD_CSD_CLK_24MHZ                          (24000000uL)
#define CapSense_1_MOD_CSD_CLK_48MHZ                          (48000000uL)

#define CapSense_1_MIN_SNS_CLK_DIVIDER                        (4u)

/* Multi-scanning types and constants */
#define CapSense_1_FREQ_CHANNEL_0                             (0u)
#define CapSense_1_FREQ_CHANNEL_1                             (1u)
#define CapSense_1_FREQ_CHANNEL_2                             (2u)

/* Scanning status bit-mask */
#define CapSense_1_SW_STS_BUSY                                (CapSense_1_STATUS_CSD0_MASK)
#define CapSense_1_NOT_BUSY                                   (0uL)

#define CapSense_1_WDGT_SW_STS_BUSY                           (CapSense_1_STATUS_WDGT0_BUSY_MASK)

#define CapSense_1_PERCENTAGE_100                             (0x00000064uL)
#define CapSense_1_DISCONNECT_IO_FLAG                         (1u)

/* CMOD and CSH capacitor port-pins registers */
#if (CapSense_1_ENABLE == CapSense_1_CSD_EN)

    # if defined(CapSense_1_CSD__DEDICATED_IO1)
        #define CapSense_1_CTANK_CONNECTION                   (CapSense_1_CSD__DEDICATED_IO1)
    #else
        #define CapSense_1_CTANK_CONNECTION                   (0x00000000uL)
    #endif /* CapSense_1_CSD__DEDICATED_IO1 */

    #if(0u != CapSense_1_CSX_EN)
        #define CapSense_1_CMOD_CONNECTION                    (CapSense_1_CSD__CSHIELD_PAD)
    #else
        #define CapSense_1_CMOD_CONNECTION                    (CapSense_1_CSD__DEDICATED_IO0)
    #endif /* (0u != CapSense_1_CSX_EN) */

    #define CapSense_1_CSD_CMOD_PORT_PTR                      (CapSense_1_Cmod_0_PORT)
    #define CapSense_1_CSD_CMOD_PIN                           (CapSense_1_Cmod_0_NUM)

    #define CapSense_1_CSD_CTANK_PORT_PTR                     (CapSense_1_Csh_0_PORT)
    #define CapSense_1_CSD_CTANK_PIN                          (CapSense_1_Csh_0_NUM)

#endif  /* (CapSense_1_ENABLE == CapSense_1_CSD_EN) */

#if(CapSense_1_IREF_SRSS != CapSense_1_CSD_IREF_SOURCE)
    #define CapSense_1_IREF_SRC_CFG   (CSD_CONFIG_IREF_SEL_Msk)
#else
    #define CapSense_1_IREF_SRC_CFG   (0u)
#endif /* (CapSense_1_CSD_IREF_SRSS != CapSense_1_CSD_IREF_SOURCE) */

#if(CapSense_1_ENABLE != CapSense_1_LP_MODE_EN)
    #define CapSense_1_PWR_MODE_CFG   (0u)
#else
    #define CapSense_1_PWR_MODE_CFG   (CSD_CONFIG_LP_MODE_Msk)
#endif /* (CapSense_1_ENABLE != CapSense_1_LP_MODE_EN) */

#endif /* End CY_SENSE_CapSense_1_SENSING_H */


/* [] END OF FILE */
